src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ВидыДоговоров/ВидыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоров</name>
  <enumValues>
    <name>СПоставщиком</name>
  </enumValues>
  <enumValues>
    <name>СПокупателем</name>
  </enumValues>
  <enumValues>
    <name>СКомитентом</name>
  </enumValues>
  <enumValues>
    <name>СКомиссионером</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ДоговорыКонтрагентов/ObjectModule.bsl
Процедура ЗаполнитьНаименованиеПоШаблону() Экспорт
	
	Наименование = "Договор № " + Номер + " от " + Формат(ДатаДоговора, "ДФ=dd.MM.yyyy");

КонецПроцедуры


Процедура ПередЗаписью(Отказ)
	
	Если (ВидДоговора = Перечисления.ВидыДоговоров.СПокупателем И Владелец.Покупатель = Ложь)
		ИЛИ (ВидДоговора = Перечисления.ВидыДоговоров.СПоставщиком И Владелец.Поставщик = Ложь)
		ИЛИ (ВидДоговора = Перечисления.ВидыДоговоров.Прочее И Владелец.ПрочиеОтношения = Ложь) Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Вид договора не соответствует типу отношений с контрагентом";
		Сообщение.Сообщить();
	КонецЕсли; 
	
	Если Владелец.Покупатель Тогда
		ВидДоговора = Перечисления.ВидыДоговоров.СПокупателем;
	ИначеЕсли Владелец.Поставщик = Истина Тогда
		ВидДоговора = Перечисления.ВидыДоговоров.СПоставщиком;
	КонецЕсли; 
	
	//Если Владелец.Покупатель = Истина И Владелец.Поставщик = Истина Тогда 
	//	ВидДоговора = Перечисления.ВидыДоговоров.СПокупателем ИЛИ ВидДоговора = Перечисления.ВидыДоговоров.СПоставщиком;
	//КонецЕсли

	
КонецПроцедуры
